proddy/EMS-ESP32/src/core/system.cpp
/*
 * EMS-ESP - https://github.com/emsesp/EMS-ESP
 * Copyright 2020-2025  emsesp.org
 * 
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#include "system.h"
#include "network.h"
#include "emsesp.h" // for send_raw_telegram() command

#ifndef EMSESP_STANDALONE
#include "esp_image_format.h"
#include "esp_ota_ops.h"
#include "esp_partition.h"
#include <esp_mac.h>
#include "esp_efuse.h"
#include <nvs.h>
#endif

#include <HTTPClient.h>
#include <map>

#include "firmwareVersion.h"

#if defined(EMSESP_TEST)
#include "../test/test.h"
#endif

#ifndef NO_TLS_SUPPORT
#define ENABLE_SMTP
#define USE_ESP_SSLCLIENT
#define READYCLIENT_SSL_CLIENT ESP_SSLClient
#define READYCLIENT_TYPE_1 // TYPE 1 when using ESP_SSLClient
#include <ESP_SSLClient.h>
#include <ReadyMail.h>
#endif

namespace emsesp {

// Languages supported. Note: the order is important
// and must match locale_translations.h and common.h
#if defined(EMSESP_TEST)
// in Test mode use two languages (en & de) to save flash memory needed for the tests
const char * const languages[] = {EMSESP_LOCALE_EN, EMSESP_LOCALE_DE};
#elif defined(EMSESP_EN_ONLY)
// EN only
const char * const languages[] = {EMSESP_LOCALE_EN};
#elif defined(EMSESP_DE_ONLY)
// EN + DE
const char * const languages[] = {EMSESP_LOCALE_EN, EMSESP_LOCALE_DE};
#else
const char * const languages[] = {EMSESP_LOCALE_EN,
                                  EMSESP_LOCALE_DE,
                                  EMSESP_LOCALE_NL,
                                  EMSESP_LOCALE_SV,
                                  EMSESP_LOCALE_PL,
                                  EMSESP_LOCALE_NO,
                                  EMSESP_LOCALE_FR,
                                  EMSESP_LOCALE_TR,
                                  EMSESP_LOCALE_IT,
                                  EMSESP_LOCALE_SK,
                                  EMSESP_LOCALE_CZ};
#endif

static constexpr uint8_t NUM_LANGUAGES = sizeof(languages) / sizeof(const char *);

#ifndef EMSESP_STANDALONE
uuid::syslog::SyslogService System::syslog_;
#endif

uuid::log::Logger System::logger_{F_(system), uuid::log::Facility::KERN};

// init statics
PButton  System::myPButton_;
bool     System::test_set_all_active_ = false;
uint32_t System::max_alloc_mem_;
uint32_t System::heap_mem_;
uint32_t System::min_free_mem_;

// GPIOs
std::vector<uint8_t, AllocatorPSRAM<uint8_t>>                     System::valid_system_gpios_;
std::vector<System::GpioUsage, AllocatorPSRAM<System::GpioUsage>> System::used_gpios_;

// find the index of the language
// 0 = EN, 1 = DE, etc...
uint8_t System::language_index() {
    for (uint8_t i = 0; i < NUM_LANGUAGES; i++) {
        if (languages[i] == locale()) {
            return i;
        }
    }
    return 0; // EN only
}

// send raw to ems
bool System::command_send(const char * value, const int8_t id) {
    return EMSESP::txservice_.send_raw(value); // ignore id
}

// send email via SMTP
bool System::command_sendmail(const char * value, const int8_t id) {
    bool     enabled = false;
    uint8_t  security;
    uint16_t port;
    String   server, login, pass, sender, recp, subject;
    EMSESP::webSettingsService.read([&](WebSettings & settings) {
        enabled  = settings.email_enabled;
        security = settings.email_security;
        server   = settings.email_server;
        port     = settings.email_port;
        login    = settings.email_login;
        pass     = settings.email_pass;
        sender   = settings.email_sender;
        recp     = settings.email_recp;
        subject  = settings.email_subject;
    });
    if (!enabled) {
        return false;
    }
    LOG_DEBUG("Command sendmail port %d%s called with '%s'",
              port,
              security == EMAIL_SECURITY::SSL        ? " (SSL)"
              : security == EMAIL_SECURITY::STARTTLS ? ""
                                                     : " (STARTTLS)",
              value);

    bool success = false;

#ifndef NO_TLS_SUPPORT
    WiFiClient *    basic_client = new WiFiClient;
    ESP_SSLClient * ssl_client   = new ESP_SSLClient;
    ReadyClient *   r_client     = new ReadyClient(*ssl_client);
    SMTPClient *    smtp         = new SMTPClient(*r_client);

    ssl_client->setClient(basic_client);
    ssl_client->setInsecure();
    ssl_client->setBufferSizes(1024, 1024);
    r_client->addPort(port,
                      security == EMAIL_SECURITY::NONE  ? readymail_protocol_plain_text
                      : security == EMAIL_SECURITY::SSL ? readymail_protocol_ssl
                                                        : readymail_protocol_tls);


    // smtp->connect(server, port, sendmailCallback);
    smtp->connect(server, port);
    if (!smtp->isConnected()) {
        LOG_ERROR("send email connection error");
        delete smtp;
        delete r_client;
        delete ssl_client;
        delete basic_client;
        return false;
    }

    // LOG_INFO("authenticate %s:%s", login.c_str(), pass.c_str());
    smtp->authenticate(login, pass, readymail_auth_password);
    if (!smtp->isAuthenticated()) {
        LOG_ERROR("send email authentication error");
        delete smtp;
        delete r_client;
        delete ssl_client;
        delete basic_client;
        return false;
    }
    JsonDocument doc(PSRAM_DOC);
    String       body = value;
    if (body.length()) {
        auto error = deserializeJson(doc, (const char *)value);
        if (!error && doc.as<JsonObject>().size() >= 0) {
            subject = doc["subject"] | subject;
            recp    = doc["to"] | recp;
            sender  = doc["from"] | sender;
            body    = doc["body"] | body;
        }
    }

    SMTPMessage & msg = smtp->getMessage();
    msg.headers.add(rfc822_subject, subject);
    msg.headers.add(rfc822_from, sender);
    msg.headers.add(rfc822_to, recp);

