proddy/EMS-ESP32/src/core/system.cpp
    // Use addCustom to add custom header e.g. Importance and Priority.
    // msg.headers.addCustom("Importance", PRIORITY);
    // msg.headers.addCustom("X-MSMail-Priority", PRIORITY);
    // msg.headers.addCustom("X-Priority", PRIORITY_NUM);
    EMSESP::webSchedulerService.computed_value.clear();
    EMSESP::webSchedulerService.raw_value = body.c_str();
    for (uint16_t wait = 0; wait < 2000 && !EMSESP::webSchedulerService.raw_value.empty(); wait++) {
        delay(1);
    }
    if (!EMSESP::webSchedulerService.computed_value.empty()) {
        body = EMSESP::webSchedulerService.computed_value.c_str();
        EMSESP::webSchedulerService.computed_value.clear();
        EMSESP::webSchedulerService.computed_value.shrink_to_fit(); // free allocated memory
    }
    msg.text.body(body);

    // bodyText.replace("\r\n", "<br>\r\n");
    // msg.html.body("<html><body><div style=\"color:#cc0066;\">" + bodyText + "</div></body></html>");
    // msg.html.transferEncoding("base64");

    // With embedFile function, the html message will send as attachment.
    // if (EMBED_MESSAGE)
    //    msg.html.embedFile(true, "msg.html", embed_message_type_attachment);

    msg.timestamp = time(nullptr);

    success = smtp->send(msg);

    delete smtp;
    delete r_client;
    delete ssl_client;
    delete basic_client;
#endif
    return success;
}

// return string of languages and count
std::string System::languages_string() {
    std::string languages_string = std::to_string(NUM_LANGUAGES) + " languages (";
    for (uint8_t i = 0; i < NUM_LANGUAGES; i++) {
        languages_string += languages[i];
        if (i != NUM_LANGUAGES - 1) {
            languages_string += ",";
        }
    }
    languages_string += ")";
    return languages_string;
}

// returns last response from MQTT
bool System::command_response(const char * value, const int8_t id, JsonObject output) {
    JsonDocument doc;
    if (DeserializationError::Ok == deserializeJson(doc, Mqtt::get_response())) {
        for (JsonPair p : doc.as<JsonObject>()) {
            output[p.key()] = p.value();
        }
    } else {
        output["response"] = Mqtt::get_response();
    }
    return true;
}

// fetch device values
bool System::command_fetch(const char * value, const int8_t id) {
    std::string value_s;
    if (Helpers::value2string(value, value_s)) {
        if (value_s == "all") {
            LOG_INFO("Requesting data from EMS devices");
            EMSESP::fetch_device_values();
        } else if (value_s == F_(boiler)) {
            EMSESP::fetch_device_values_type(EMSdevice::DeviceType::BOILER);
        } else if (value_s == F_(thermostat)) {
            EMSESP::fetch_device_values_type(EMSdevice::DeviceType::THERMOSTAT);
        } else if (value_s == F_(solar)) {
            EMSESP::fetch_device_values_type(EMSdevice::DeviceType::SOLAR);
        } else if (value_s == F_(mixer)) {
            EMSESP::fetch_device_values_type(EMSdevice::DeviceType::MIXER);
        }
    } else {
        EMSESP::fetch_device_values(); // default if no name or id is given
    }

    return true; // always true
}

// mqtt publish
bool System::command_publish(const char * value, const int8_t id) {
    std::string value_s;
    if (Helpers::value2string(value, value_s)) {
        if (value_s == "ha") {
            EMSESP::publish_all(true); // includes HA
            LOG_INFO("Publishing all data to MQTT, including HA configs");
            return true;
        } else if (value_s == (F_(boiler))) {
            EMSESP::publish_device_values(EMSdevice::DeviceType::BOILER);
            return true;
        } else if (value_s == (F_(thermostat))) {
            EMSESP::publish_device_values(EMSdevice::DeviceType::THERMOSTAT);
            return true;
        } else if (value_s == (F_(solar))) {
            EMSESP::publish_device_values(EMSdevice::DeviceType::SOLAR);
            return true;
        } else if (value_s == (F_(mixer))) {
            EMSESP::publish_device_values(EMSdevice::DeviceType::MIXER);
            return true;
        } else if (value_s == (F_(water))) {
            EMSESP::publish_device_values(EMSdevice::DeviceType::WATER);
            return true;
        } else if (value_s == "other") {
            EMSESP::publish_other_values(); // switch and heat pump
            return true;
        } else if ((value_s == (F_(temperaturesensor))) || (value_s == (F_(analogsensor)))) {
            EMSESP::publish_sensor_values(true);
            return true;
        }
    }

    LOG_INFO("Publishing all data to MQTT");
    EMSESP::publish_all();

    return true;
}

// syslog level
// commenting this out - don't see the point on having an API service to change the syslog level
/*
bool System::command_syslog_level(const char * value, const int8_t id) {
    uint8_t s = 0xff;
    if (Helpers::value2enum(value, s, FL_(list_syslog_level))) {
        bool changed = false;
        EMSESP::webSettingsService.update(
            [&](WebSettings & settings) {
                if (settings.syslog_level != (int8_t)s - 1) {
                    settings.syslog_level = (int8_t)s - 1;
                    changed               = true;
                }
                return StateUpdateResult::CHANGED;
            });
        if (changed) {
            EMSESP::system_.syslog_init();
        }
        return true;
    }
    return false;
}
*/

// send message - to system log and MQTT
bool System::command_message(const char * value, const int8_t id, JsonObject output) {
    if (value == nullptr || value[0] == '\0') {
        LOG_WARNING("Message is empty");
        return false; // must have a string value
    }

    EMSESP::webSchedulerService.computed_value.clear();
    EMSESP::webSchedulerService.raw_value = value;
    for (uint16_t wait = 0; wait < 2000 && !EMSESP::webSchedulerService.raw_value.empty(); wait++) {
        delay(1);
    }

    if (EMSESP::webSchedulerService.computed_value.empty()) {
        LOG_WARNING("Message result is empty");
        return false;
    }

