proddy/EMS-ESP32/src/core/system.cpp
    const esp_partition_t * partition = esp_partition_get(it);
    esp_partition_iterator_release(it);

    if (partition == nullptr) {
        return false;
    }

    // Set the boot partition
    esp_err_t err = esp_ota_set_boot_partition(partition);
    if (err != ESP_OK) {
        return false;
    }

    // initiate the restart
    EMSESP::system_.systemStatus(SYSTEM_STATUS::SYSTEM_STATUS_RESTART_REQUESTED);
    return true;
#endif
}

// restart EMS-ESP
// app0 or app1, or boot/factory on 16MB boards
void System::system_restart(const char * partitionname) {
    // see if we are forcing a partition to use
    if (partitionname != nullptr) {
#ifndef EMSESP_STANDALONE
        // Factory partition - label will be "factory"
        const esp_partition_t * partition = esp_partition_find_first(ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_APP_FACTORY, NULL);
        if (partition && !strcmp(partition->label, partitionname)) {
            esp_ota_set_boot_partition(partition);
        } else
            // try and find the partition by name
            if (strcmp(esp_ota_get_running_partition()->label, partitionname)) {
                // not found, get next one in cycle
                partition = esp_ota_get_next_update_partition(nullptr);
                if (!partition) {
                    LOG_ERROR("Partition '%s' not found", partitionname);
                    return;
                }
                if (strcmp(partition->label, partitionname) && strcmp(partitionname, "boot") != 0) {
                    partition = esp_ota_get_next_update_partition(partition);
                    if (!partition || strcmp(partition->label, partitionname)) {
                        LOG_ERROR("Partition '%s' not found", partitionname);
                        return;
                    }
                }
                // error if partition is empty
                uint64_t buffer;
                esp_partition_read(partition, 0, &buffer, 8);
                if (buffer == 0xFFFFFFFFFFFFFFFF) {
                    LOG_ERROR("Partition '%s' is empty, not bootable", partition->label);
                    return;
                }
                // set the boot partition
                esp_ota_set_boot_partition(partition);
            }
#endif
        LOG_INFO("Restarting EMS-ESP from %s partition", partitionname);
    } else {
        LOG_INFO("Restarting EMS-ESP...");
    }

    store_nvs_values(); // save any NVS values

    // flush all the log
    EMSESP::webLogService.loop(); // dump all to web log
    for (int i = 0; i < 10; i++) {
        Shell::loop_all();
        delay(10); // give telnet TCP stack time to transmit
    }
    Serial.flush(); // wait for hardware TX buffer to drain

    Mqtt::disconnect(); // gracefully disconnect MQTT, needed for QOS1
    EMSuart::stop();    // stop UART so there is no interference
#ifndef EMSESP_STANDALONE
    delay(1000);   // wait 1 second
    ESP.restart(); // ka-boom! - this is the only place where the ESP32 restart is called
#endif
}

void System::syslog_init() {
    EMSESP::webSettingsService.read([&](WebSettings & settings) {
        syslog_enabled_       = settings.syslog_enabled;
        syslog_level_         = settings.syslog_level;
        syslog_mark_interval_ = settings.syslog_mark_interval;
        syslog_host_          = settings.syslog_host;
        syslog_port_          = settings.syslog_port;
    });
#ifndef EMSESP_STANDALONE
    if (syslog_enabled_) {
        // start & configure syslog
        syslog_.maximum_log_messages(10);
        syslog_.log_level((uuid::log::Level)syslog_level_);
        syslog_.mark_interval(syslog_mark_interval_);
        syslog_.destination(syslog_host_.c_str(), syslog_port_);
        syslog_.hostname(hostname());
        EMSESP::logger().info("Starting Syslog service");
    } else if (syslog_.started()) {
        // in case service is still running, this flushes the queue
        // https://github.com/emsesp/EMS-ESP/issues/496
        EMSESP::logger().info("Stopping Syslog");
        syslog_.loop();
        syslog_.log_level(uuid::log::Level::OFF); // stop server
        syslog_.mark_interval(0);
        // syslog_.destination("");
    }
    if (Mqtt::publish_single()) {
        if (Mqtt::publish_single2cmd()) {
            Mqtt::queue_publish("system/syslog", syslog_enabled_ ? (FL_(list_syslog_level)[syslog_level_ + 1]) : "off");
            if (EMSESP::watch_id() == 0 || EMSESP::watch() == 0) {
                Mqtt::queue_publish("system/watch",
                                    EMSESP::system_.enum_format() == ENUM_FORMAT_INDEX ? Helpers::itoa(EMSESP::watch()) : (FL_(list_watch)[EMSESP::watch()]));
            } else {
                Mqtt::queue_publish("system/watch", Helpers::hextoa(EMSESP::watch_id()));
            }

        } else {
            Mqtt::queue_publish("system_data/syslog", syslog_enabled_ ? (FL_(list_syslog_level)[syslog_level_ + 1]) : "off");
            if (EMSESP::watch_id() == 0 || EMSESP::watch() == 0) {
                Mqtt::queue_publish("system_data/watch",
                                    EMSESP::system_.enum_format() == ENUM_FORMAT_INDEX ? Helpers::itoa(EMSESP::watch()) : (FL_(list_watch)[EMSESP::watch()]));
            } else {
                Mqtt::queue_publish("system_data/watch", Helpers::hextoa(EMSESP::watch_id()));
            }
        }
    }
#endif
}

// start or reconfigure modbus
void System::modbus_init() {
    EMSESP::webSettingsService.read([&](WebSettings & settings) {
        if (settings.modbus_enabled) {
            if (EMSESP::modbus_ == nullptr) {
                EMSESP::modbus_ = new Modbus;
                EMSESP::modbus_->start(1, settings.modbus_port, settings.modbus_max_clients, settings.modbus_timeout * 1000);
            } else if (settings.modbus_port != modbus_port_ || settings.modbus_max_clients != modbus_max_clients_ || settings.modbus_timeout != modbus_timeout_) {
                EMSESP::modbus_->stop();
                EMSESP::modbus_->start(1, settings.modbus_port, settings.modbus_max_clients, settings.modbus_timeout * 1000);
            }
        } else if (EMSESP::modbus_ != nullptr) {
            EMSESP::modbus_->stop();
            delete EMSESP::modbus_;
            EMSESP::modbus_ = nullptr;
        }
        modbus_enabled_     = settings.modbus_enabled;
        modbus_port_        = settings.modbus_port;
        modbus_max_clients_ = settings.modbus_max_clients;
        modbus_timeout_     = settings.modbus_timeout;
    });
}

// read specific major system settings to store locally for faster access
void System::store_settings(WebSettings & settings) {
    rx_gpio_      = settings.rx_gpio;
    tx_gpio_      = settings.tx_gpio;
    pbutton_gpio_ = settings.pbutton_gpio;

    low_clock_      = settings.low_clock;
    board_profile_  = settings.board_profile;
    telnet_enabled_ = settings.telnet_enabled;

