proddy/EMS-ESP32/src/core/system.cpp
    shell.println();
    shell.println("Network:");
    switch (WiFi.status()) {
    case WL_IDLE_STATUS:
        shell.printfln(" WiFi Status: Idle");
        break;

    case WL_NO_SSID_AVAIL:
        shell.printfln(" WiFi Status: Network not found");
        break;

    case WL_SCAN_COMPLETED:
        shell.printfln(" WiFi Status: Network scan complete");
        break;

    case WL_CONNECTED:
        shell.printfln(" WiFi Status: Connected");
        shell.printfln(" SSID: %s", WiFi.SSID().c_str());
        shell.printfln(" BSSID: %s", WiFi.BSSIDstr().c_str());
        shell.printfln(" RSSI: %d dBm (%d %%)", WiFi.RSSI(), wifi_quality(WiFi.RSSI()));
        char result[10];
        shell.printfln(" TxPower: %s dBm", Helpers::render_value(result, (double)(WiFi.getTxPower() / 4), 1));
        shell.printfln(" MAC address: %s", WiFi.macAddress().c_str());
        shell.printfln(" Hostname: %s", WiFi.getHostname());
        shell.printfln(" IPv4 address: %s/%s", uuid::printable_to_string(WiFi.localIP()).c_str(), uuid::printable_to_string(WiFi.subnetMask()).c_str());
        shell.printfln(" IPv4 gateway: %s", uuid::printable_to_string(WiFi.gatewayIP()).c_str());
        shell.printfln(" IPv4 nameserver: %s", uuid::printable_to_string(WiFi.dnsIP()).c_str());
        if (WiFi.linkLocalIPv6().toString() != "0000:0000:0000:0000:0000:0000:0000:0000" && WiFi.linkLocalIPv6().toString() != "::") {
            shell.printfln(" IPv6 address: %s", uuid::printable_to_string(WiFi.linkLocalIPv6()).c_str());
        }
        break;

    case WL_CONNECT_FAILED:
        shell.printfln(" WiFi Network: Connection failed");
        break;

    case WL_CONNECTION_LOST:
        shell.printfln(" WiFi Network: Connection lost");
        break;

    case WL_DISCONNECTED:
        shell.printfln(" WiFi Network: Disconnected");
        break;

    // case WL_NO_SHIELD:
    default:
        shell.printfln(" WiFi MAC address: %s", WiFi.macAddress().c_str());
        shell.printfln(" WiFi Network: not connected");
        break;
    }

    // show Ethernet if connected
    if (EMSESP::network_.ethernet_connected()) {
        shell.println();
        shell.printfln(" Ethernet Status: connected");
        shell.printfln(" Ethernet MAC address: %s", ETH.macAddress().c_str());
        shell.printfln(" Hostname: %s", ETH.getHostname());
        shell.printfln(" IPv4 address: %s/%s", uuid::printable_to_string(ETH.localIP()).c_str(), uuid::printable_to_string(ETH.subnetMask()).c_str());
        shell.printfln(" IPv4 gateway: %s", uuid::printable_to_string(ETH.gatewayIP()).c_str());
        shell.printfln(" IPv4 nameserver: %s", uuid::printable_to_string(ETH.dnsIP()).c_str());
        if (ETH.linkLocalIPv6().toString() != "0000:0000:0000:0000:0000:0000:0000:0000" && ETH.linkLocalIPv6().toString() != "::") {
            shell.printfln(" IPv6 address: %s", uuid::printable_to_string(ETH.linkLocalIPv6()).c_str());
        }
    }

    // show AP is connected
    if (EMSESP::network_.ap_connected()) {
        shell.printfln(" AP Status: connected");
    }

    shell.println();
    shell.println("Syslog:");
    if (!syslog_enabled_) {
        shell.printfln(" Syslog: disabled");
    } else {
        shell.printfln(" Syslog: %s", syslog_.started() ? "started" : "stopped");
        shell.print(" ");
        shell.printfln(F_(host_fmt), !syslog_host_.isEmpty() ? syslog_host_.c_str() : F_(unset));
        shell.printfln(" IP: %s", uuid::printable_to_string(syslog_.ip()).c_str());
        shell.print(" ");
        shell.printfln(F_(port_fmt), syslog_port_);
        shell.print(" ");
        shell.printfln(F_(log_level_fmt), uuid::log::format_level_lowercase(static_cast<uuid::log::Level>(syslog_level_)));
        shell.print(" ");
        shell.printfln(F_(mark_interval_fmt), syslog_mark_interval_);
        shell.printfln(" Queued: %d", syslog_.queued());
    }

    shell.println();
#endif
}

// see if there is a restore of an older settings file that needs to be applied
// note there can be only one file at a time
bool System::check_restore() {
    bool reboot_required = false; // true if we need to reboot

#ifndef EMSESP_STANDALONE
    File new_file = LittleFS.open(TEMP_FILENAME_PATH);
    if (new_file) {
        JsonDocument         jsonDocument(PSRAM_DOC);
        DeserializationError error = deserializeJson(jsonDocument, new_file);
        if (error == DeserializationError::Ok && jsonDocument.is<JsonObject>()) {
            JsonObject input = jsonDocument.as<JsonObject>();
            // see what type of file it is, either settings or customization. anything else is ignored
            std::string settings_type = input["type"];
            LOG_INFO("Restoring '%s' settings...", settings_type.c_str());

            // system backup, which is a consolidated json object with all the settings files
            if (settings_type == "systembackup") {
                reboot_required    = true;
                JsonArray sections = input["systembackup"].as<JsonArray>();
                for (JsonObject section : sections) {
                    std::string section_type = section["type"];
                    LOG_DEBUG("Restoring '%s' section...", section_type.c_str());
                    if (section_type == "settings") {
                        saveSettings(NETWORK_SETTINGS_FILE, section);
                        saveSettings(AP_SETTINGS_FILE, section);
                        saveSettings(MQTT_SETTINGS_FILE, section);
                        saveSettings(NTP_SETTINGS_FILE, section);
                        saveSettings(SECURITY_SETTINGS_FILE, section);

                        // next is application settings
                        // we need to set the EMS Bus ID to 0x49 if it's 0x0B and coming from a version which is < v3.9.0
                        std::string     settingsVersion = section["Settings"]["version"];
                        FirmwareVersion settings_version(settingsVersion);
                        if (settings_version < FirmwareVersion("3.9.0")) {
                            if (section["Settings"]["ems_bus_id"].is<int>()) {
                                int ems_bus_id = section["Settings"]["ems_bus_id"];
                                if (ems_bus_id == 0x0B) {
                                    // set to EMSESP_DEFAULT_EMS_BUS_ID
                                    section["Settings"]["ems_bus_id"] = EMSESP_DEFAULT_EMS_BUS_ID;
                                    LOG_INFO("Overriding EMS Bus ID to %02X (was %02X)", EMSESP_DEFAULT_EMS_BUS_ID, ems_bus_id);
                                }
                            }
                        }
                        // continue processing the rest of the sections
                        saveSettings(EMSESP_SETTINGS_FILE, section);
                    }
                    if (section_type == "schedule") {
                        saveSettings(EMSESP_SCHEDULER_FILE, section);
                    }
                    if (section_type == "customizations") {
                        saveSettings(EMSESP_CUSTOMIZATION_FILE, section);
                    }
                    if (section_type == "entities") {
                        saveSettings(EMSESP_CUSTOMENTITY_FILE, section);
                    }
                    if (section_type == "modules") {
                        saveSettings(EMSESP_MODULES_FILE, section);
                    }
                    if (section_type == "customSupport") {
                        // it's a custom support, extract json and write to /config/customSupport.json file
                        File customSupportFile = LittleFS.open(EMSESP_CUSTOMSUPPORT_FILE, "w");
                        if (customSupportFile) {
                            serializeJson(section, customSupportFile);
                            customSupportFile.close();
                            LOG_INFO("Custom support file updated");
                        } else {
                            LOG_ERROR("Failed to save custom support file");
                        }
                    }

                    if (section_type == "nvs") {
                        // Restore NVS values
                        JsonArray nvs_entries = section["nvs"].as<JsonArray>();
                        for (JsonObject entry : nvs_entries) {
                            std::string key  = entry["key"] | "";
                            int         type = entry["type"] | NVS_TYPE_ANY;

                            switch (type) {
                            case NVS_TYPE_I8:
                                if (entry["value"].is<JsonVariantConst>()) {
                                    int8_t v = entry["value"];
                                    EMSESP::nvs_.putChar(key.c_str(), v);
                                    LOG_DEBUG("Restored NVS value: %s = %d", key.c_str(), v);
                                }
                                break;
                            case NVS_TYPE_U8:
                                if (entry["value"].is<JsonVariantConst>()) {
                                    uint8_t v = entry["value"];
                                    EMSESP::nvs_.putUChar(key.c_str(), v);
                                    LOG_DEBUG("Restored NVS value: %s = %d", key.c_str(), v);
                                }
                                break;
                            case NVS_TYPE_I32:
                                if (entry["value"].is<JsonVariantConst>()) {
                                    int32_t v = entry["value"];
                                    EMSESP::nvs_.putInt(key.c_str(), v);
                                    LOG_DEBUG("Restored NVS value: %s = %d", key.c_str(), v);
                                }
                                break;
                            case NVS_TYPE_U32:
                                if (entry["value"].is<JsonVariantConst>()) {
                                    uint32_t v = entry["value"];
                                    EMSESP::nvs_.putUInt(key.c_str(), v);
                                    LOG_DEBUG("Restored NVS value: %s = %d", key.c_str(), v);
                                }
                                break;
                            case NVS_TYPE_I64:
                                if (entry["value"].is<JsonVariantConst>()) {
                                    int64_t v = entry["value"];
                                    EMSESP::nvs_.putLong64(key.c_str(), v);
                                    LOG_DEBUG("Restored NVS value: %s = %d", key.c_str(), v);
                                }
                                break;
                            case NVS_TYPE_U64:
                                if (entry["value"].is<JsonVariantConst>()) {
                                    uint64_t v = entry["value"];
                                    EMSESP::nvs_.putULong64(key.c_str(), v);
                                    LOG_DEBUG("Restored NVS value: %s = %d", key.c_str(), v);
                                }
                                break;
                            case NVS_TYPE_BLOB:
                                // used for double values
                                if (entry["value"].is<JsonVariantConst>()) {
                                    double v = entry["value"];
                                    EMSESP::nvs_.putDouble(key.c_str(), v);
                                    LOG_DEBUG("Restored NVS value: %s = %d", key.c_str(), v);
                                }
                                break;
                            case NVS_TYPE_STR:
                            case NVS_TYPE_ANY:
                            default:
                                if (entry["value"].is<JsonVariantConst>()) {
                                    std::string v = entry["value"];
                                    EMSESP::nvs_.putString(key.c_str(), v.c_str());
                                    LOG_DEBUG("Restored NVS value: %s = %s", key.c_str(), v.c_str());
                                }
                                break;
                            }
                        }
                    }
                }
            }

            // It's a single settings file. Parse each section separately. If it's system related it will require a reboot
            else if (settings_type == "settings") {
                reboot_required = saveSettings(NETWORK_SETTINGS_FILE, input);
                reboot_required |= saveSettings(AP_SETTINGS_FILE, input);
                reboot_required |= saveSettings(MQTT_SETTINGS_FILE, input);
                reboot_required |= saveSettings(NTP_SETTINGS_FILE, input);
                reboot_required |= saveSettings(SECURITY_SETTINGS_FILE, input);
                reboot_required |= saveSettings(EMSESP_SETTINGS_FILE, input);
            } else if (settings_type == "customizations") {
                saveSettings(EMSESP_CUSTOMIZATION_FILE, input);
            } else if (settings_type == "schedule") {
                saveSettings(EMSESP_SCHEDULER_FILE, input);
            } else if (settings_type == "entities") {
                saveSettings(EMSESP_CUSTOMENTITY_FILE, input);
            } else if (settings_type == "customSupport") {
                // it's a custom support file - save it to /config
                new_file.close();
                if (LittleFS.rename(TEMP_FILENAME_PATH, EMSESP_CUSTOMSUPPORT_FILE)) {
                    LOG_INFO("Custom support file stored");
                    return false; // no need to reboot
                } else {
                    LOG_ERROR("Failed to save custom support file");
                }
            } else {
                LOG_ERROR("Unrecognized file uploaded");
            }
        } else {
            LOG_ERROR("Unrecognized file uploaded, not json.");
        }

        // close (just in case) and remove the temp file
        new_file.close();
        LittleFS.remove(TEMP_FILENAME_PATH);
    }
#endif

    return reboot_required;
}

// handle upgrades from previous versions
// this function will not be called on a clean install, with no settings files yet created
// returns true if we need a reboot
bool System::check_upgrade() {
    bool        missing_version = true;
    std::string settingsVersion;

    // fetch current version from settings file
    EMSESP::webSettingsService.read([&](WebSettings const & settings) { settingsVersion = settings.version.c_str(); });

    // see if we're missing a version, will be < 3.5.0b13 from Dec 23 2022
    missing_version = (settingsVersion.empty() || (settingsVersion.length() < 5));
    if (missing_version) {
        LOG_WARNING("No version information found. Assuming version 3.5.0");
        settingsVersion = "3.5.0"; // this was the last stable version without version info
    }

    FirmwareVersion settings_version(settingsVersion);
    FirmwareVersion this_version(EMSESP_APP_VERSION);

